---
kind: type
id: T:Autodesk.Revit.DB.ZoomFitType
source: html/9a2714db-3dc9-506a-e79e-9a4ad0d4b101.htm
---
# Autodesk.Revit.DB.ZoomFitType

This enum is used to define type of zoom.

## Syntax (C#)
```csharp
public enum ZoomFitType
```